# Задание 2
print('Введите два числа')
a = int(input())
b = int(input())
print(a, 'умноженное на', b, 'равно', a*b)
print(a, 'деленное на', b, 'равно', float(a / b))
print(a, 'нацело деленное на', b, 'равно', a // b)
print('Остаток от деления', a, 'на', b, 'равен', a % b)
print(a, 'в степени', b, 'равно', a ** b)
