# Задание 3
print('Введите номер билета')
n = int(input())
a = n // 100000
b = n // 10000 % 10
c = n // 1000 % 10
d = n % 1000 // 100
e = n % 100 // 10
f = n % 10
if a+b+c == d+e+f:
    print('Билет', n, 'счастливый')
else:
    print('Билет', n, 'НЕсчастливый')
