# Задание 1
print('Введите пароль')
pas_1 = input()
pas_2 = input()

if pas_1 == pas_2:
    print('Все окей!')
else:
    print('Пароли не совпадают!')
